INSERT INTO [Countries] ([Name])
VALUES 
('Україна'),
('США'),
('Канада'),
('Мексика'),
('Бразилія'),
('Велика Британія'),
('Франція'),
('Німеччина'),
('Іспанія'),
('Італія'),
('Австралія'),
('Японія'),
('Китай'),
('Індія'),
('Південна Африка');

INSERT INTO [Themes] ([Name])
VALUES 
('Фентезі'),
('Наукова фантастика'),
('Романи'),
('Трилери'),
('Детектив'),
('Біографія'),
('Саморозвиток'),
('Історія'),
('Філософія'),
('Пригоди'),
('Драми'),
('Жахи'),
('Поезія'),
('Комедія'),
('Графічний роман');

INSERT INTO [Authors] ([Name], [Surname], [CountryId])
VALUES 
('Тарас', 'Шевченко', 1),
('Леся', 'Українка', 1),
('Микола', 'Гоголь', 1),
('Іван', 'Франко', 1),
('Габріель', 'Гарсія Маркес', 4),
('Пауло', 'Коельо', 5),
('Харукі', 'Муракамі', 11),
('Чарльз', 'Дікенс', 6),
('Джейн', 'Остін', 6),
('Марк', 'Твен', 2),
('Едгар', 'По', 2),
('Жуль', 'Верн', 7),
('Джордж', 'Орвелл', 6),
('Рей', 'Бредбері', 2),
('Френк', 'Герберт', 2);

INSERT INTO [Shops] ([Name], [CountryId])
VALUES 
('Буква', 1),
('Ярослав', 1),
('Буква', 2),
('Ватерстоунс', 6),
('Індіго', 3),
('Сотано', 4),
('FNAC', 7),
('Хугендубель', 8),
('Ла Каса дель Лібрo', 9),
('Мондаторі', 10),
('Дімокс', 11),
('Кінокунія', 12),
('Сіньхуа', 13),
('Кросворд', 14),
('Екслюзив Букс', 15);

INSERT INTO [Books] ([Name], [Pages], [Price], [PublishDate], [AuthorId], [ThemeId])
VALUES 
('Кобзар', 384, 18.99, '1840-01-01', 1, 13),
('Лісова пісня', 192, 15.99, '1911-01-01', 2, 10),
('Вій', 256, 20.99, '1835-01-01', 3, 11),
('Захар Беркут', 320, 17.99, '1883-01-01', 4, 11),
('Сто років самотності', 417, 21.99, '1967-05-30', 5, 6),
('Алхімік', 208, 18.99, '1988-04-19', 6, 7),
('Норвезький ліс', 296, 17.99, '1987-09-01', 7, 10),
('Великі надії', 505, 22.99, '1861-01-01', 8, 3),
('Гордість і упередження', 432, 21.99, '1813-01-01', 9, 3),
('Пригоди Тома Сойєра', 274, 16.99, '1876-06-01', 10, 11),
('Ворон', 128, 17.99, '1845-01-01', 11, 12),
('П`ять тижнів на повітряній кулі', 256, 20.99, '1863-01-01', 12, 4),
('1984', 328, 19.99, '1949-06-08', 13, 2),
('451° за Фаренгейтом', 158, 15.99, '1953-10-19', 14, 2),
('Дюна', 896, 25.99, '1965-08-01', 15, 2);

INSERT INTO [Sales] ([Price], [Quantity], [SaleDate], [BookId], [ShopId])
VALUES 
(18.99, 3, '2024-04-01', 1, 1),
(15.99, 5, '2024-04-02', 2, 2),
(20.99, 2, '2024-04-03', 3, 3),
(17.99, 4, '2024-04-04', 4, 4),
(21.99, 3, '2024-04-05', 5, 5),
(18.99, 6, '2024-04-06', 6, 6),
(17.99, 2, '2024-04-07', 7, 7),
(22.99, 5, '2024-04-08', 8, 8),
(18.99, 3, '2024-04-09', 9, 9),
(17.99, 4, '2024-04-10', 10, 10),
(25.99, 2, '2024-04-11', 11, 11),
(19.99, 1, '2024-04-12', 12, 12),
(21.99, 4, '2024-04-13', 13, 13),
(15.99, 3, '2024-04-14', 14, 14),
(25.99, 5, '2024-04-15', 15, 15);